window.BishopCaptureProblems = [
  {
    "id": "слон_capture_a3",
    "fen": "8/1r6/8/8/8/B7/8/2n3n1 w - - 0 1",
    "moves": "a3c1",
    "title": "Что может взять слон на a3?"
  },
  {
    "id": "слон_capture_h5",
    "fen": "8/8/r7/7B/6q1/8/8/7q w - - 0 1",
    "moves": "h5g4",
    "title": "Что может взять слон на h5?"
  },
  {
    "id": "слон_capture_h8",
    "fen": "7B/4b3/8/8/8/8/2b5/b7 w - - 0 1",
    "moves": "h8a1",
    "title": "Что может взять слон на h8?"
  },
  {
    "id": "слон_capture_d1",
    "fen": "8/8/p7/8/5nb1/8/8/3B4 w - - 0 1",
    "moves": "d1g4",
    "title": "Что может взять слон на d1?"
  },
  {
    "id": "слон_capture_h7",
    "fen": "2n5/7B/8/8/8/6p1/8/1n6 w - - 0 1",
    "moves": "h7b1",
    "title": "Что может взять слон на h7?"
  },
  {
    "id": "слон_capture_d7",
    "fen": "8/3B1r2/8/2n5/6r1/8/8/8 w - - 0 1",
    "moves": "d7g4",
    "title": "Что может взять слон на d7?"
  },
  {
    "id": "слон_capture_b2",
    "fen": "8/8/7q/2n1n3/8/8/1B6/8 w - - 0 1",
    "moves": "b2e5",
    "title": "Что может взять слон на b2?"
  },
  {
    "id": "слон_capture_f5",
    "fen": "8/8/1n6/4rB2/8/3p4/8/8 w - - 0 1",
    "moves": "f5d3",
    "title": "Что может взять слон на f5?"
  },
  {
    "id": "слон_capture_c8",
    "fen": "2B3q1/8/8/5p2/8/8/7q/8 w - - 0 1",
    "moves": "c8f5",
    "title": "Что может взять слон на c8?"
  },
  {
    "id": "слон_capture_b7",
    "fen": "q7/1B6/7q/8/8/8/8/3n4 w - - 0 1",
    "moves": "b7a8",
    "title": "Что может взять слон на b7?"
  },
  {
    "id": "слон_capture_d7",
    "fen": "4q3/3B4/8/8/8/5q2/7q/8 w - - 0 1",
    "moves": "d7e8",
    "title": "Что может взять слон на d7?"
  },
  {
    "id": "слон_capture_a4",
    "fen": "8/8/8/q7/B7/1r6/6q1/8 w - - 0 1",
    "moves": "a4b3",
    "title": "Что может взять слон на a4?"
  },
  {
    "id": "слон_capture_f1",
    "fen": "8/8/3p4/8/8/7n/8/b4B2 w - - 0 1",
    "moves": "f1h3",
    "title": "Что может взять слон на f1?"
  },
  {
    "id": "слон_capture_f7",
    "fen": "8/5B2/2q5/7q/3q4/8/8/8 w - - 0 1",
    "moves": "f7h5",
    "title": "Что может взять слон на f7?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/2b5/8/8/8/3B3r/8/1b6 w - - 0 1",
    "moves": "d3b1",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_e8",
    "fen": "4B3/8/4q3/6r1/r7/8/8/8 w - - 0 1",
    "moves": "e8a4",
    "title": "Что может взять слон на e8?"
  },
  {
    "id": "слон_capture_b8",
    "fen": "1B6/8/8/8/8/5b2/7b/1n6 w - - 0 1",
    "moves": "b8h2",
    "title": "Что может взять слон на b8?"
  },
  {
    "id": "слон_capture_c8",
    "fen": "2B5/8/4n3/8/q7/6q1/8/8 w - - 0 1",
    "moves": "c8e6",
    "title": "Что может взять слон на c8?"
  },
  {
    "id": "слон_capture_a6",
    "fen": "8/7n/B7/1r6/8/8/7n/8 w - - 0 1",
    "moves": "a6b5",
    "title": "Что может взять слон на a6?"
  },
  {
    "id": "слон_capture_b3",
    "fen": "8/2r5/8/3q4/7r/1B6/8/8 w - - 0 1",
    "moves": "b3d5",
    "title": "Что может взять слон на b3?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "n7/8/7b/8/8/8/8/5b1B w - - 0 1",
    "moves": "h1a8",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_a3",
    "fen": "4n3/8/8/8/1q6/B7/8/6b1 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять слон на a3?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "1n6/6n1/2B5/3b4/8/8/8/8 w - - 0 1",
    "moves": "c6d5",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_g2",
    "fen": "8/1b6/8/8/8/2q5/4b1B1/8 w - - 0 1",
    "moves": "g2b7",
    "title": "Что может взять слон на g2?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "8/3b4/4B3/6q1/8/8/2p5/8 w - - 0 1",
    "moves": "e6d7",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_b7",
    "fen": "2r5/1B6/6p1/5r2/8/8/8/8 w - - 0 1",
    "moves": "b7c8",
    "title": "Что может взять слон на b7?"
  },
  {
    "id": "слон_capture_d7",
    "fen": "8/3B2p1/8/8/6n1/8/3b4/8 w - - 0 1",
    "moves": "d7g4",
    "title": "Что может взять слон на d7?"
  },
  {
    "id": "слон_capture_d7",
    "fen": "1r6/3B4/8/2n5/6b1/8/8/8 w - - 0 1",
    "moves": "d7g4",
    "title": "Что может взять слон на d7?"
  },
  {
    "id": "слон_capture_c4",
    "fen": "3b4/8/2q5/8/2B5/3p4/8/8 w - - 0 1",
    "moves": "c4d3",
    "title": "Что может взять слон на c4?"
  },
  {
    "id": "слон_capture_c8",
    "fen": "2B5/8/p7/3r4/8/8/8/4r3 w - - 0 1",
    "moves": "c8a6",
    "title": "Что может взять слон на c8?"
  },
  {
    "id": "слон_capture_h5",
    "fen": "8/8/6n1/7B/8/8/5n1b/8 w - - 0 1",
    "moves": "h5g6",
    "title": "Что может взять слон на h5?"
  },
  {
    "id": "слон_capture_f1",
    "fen": "8/8/p7/8/4b3/2r5/8/5B2 w - - 0 1",
    "moves": "f1a6",
    "title": "Что может взять слон на f1?"
  },
  {
    "id": "слон_capture_g4",
    "fen": "8/8/1n6/8/6B1/7p/6r1/8 w - - 0 1",
    "moves": "g4h3",
    "title": "Что может взять слон на g4?"
  },
  {
    "id": "слон_capture_e7",
    "fen": "8/4B3/3n2b1/8/8/8/8/r7 w - - 0 1",
    "moves": "e7d6",
    "title": "Что может взять слон на e7?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "5r2/1q6/8/2B5/8/6p1/8/8 w - - 0 1",
    "moves": "c5f8",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "7r/8/2b5/8/1r6/8/3B4/8 w - - 0 1",
    "moves": "d2b4",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_e3",
    "fen": "3n4/8/8/8/8/1r2B3/3b4/8 w - - 0 1",
    "moves": "e3d2",
    "title": "Что может взять слон на e3?"
  },
  {
    "id": "слон_capture_g1",
    "fen": "8/b7/4b3/8/8/8/3r4/6B1 w - - 0 1",
    "moves": "g1a7",
    "title": "Что может взять слон на g1?"
  },
  {
    "id": "слон_capture_g2",
    "fen": "8/8/6q1/8/8/8/5pB1/7b w - - 0 1",
    "moves": "g2h1",
    "title": "Что может взять слон на g2?"
  },
  {
    "id": "слон_capture_a4",
    "fen": "3n4/8/1p6/8/B7/8/2r5/8 w - - 0 1",
    "moves": "a4c2",
    "title": "Что может взять слон на a4?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "8/7q/4B3/8/2r5/8/8/3b4 w - - 0 1",
    "moves": "e6c4",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_f1",
    "fen": "8/8/8/7n/8/3q4/8/5B1b w - - 0 1",
    "moves": "f1d3",
    "title": "Что может взять слон на f1?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "4n3/8/8/6r1/4p3/8/8/1B6 w - - 0 1",
    "moves": "b1e4",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "8/1n6/6B1/8/8/8/8/1b4n1 w - - 0 1",
    "moves": "g6b1",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_f2",
    "fen": "8/8/7n/8/8/4r3/b4B2/8 w - - 0 1",
    "moves": "f2e3",
    "title": "Что может взять слон на f2?"
  },
  {
    "id": "слон_capture_e1",
    "fen": "8/8/5b2/8/8/6r1/2n5/4B3 w - - 0 1",
    "moves": "e1g3",
    "title": "Что может взять слон на e1?"
  },
  {
    "id": "слон_capture_f1",
    "fen": "8/8/q7/8/3b4/8/8/5B1r w - - 0 1",
    "moves": "f1a6",
    "title": "Что может взять слон на f1?"
  },
  {
    "id": "слон_capture_h2",
    "fen": "8/8/1q6/3r4/5p2/8/7B/8 w - - 0 1",
    "moves": "h2f4",
    "title": "Что может взять слон на h2?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "8/4n2b/5B2/8/5n2/8/8/8 w - - 0 1",
    "moves": "f6e7",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_c3",
    "fen": "8/1b6/8/q7/8/2B5/8/5n2 w - - 0 1",
    "moves": "c3a5",
    "title": "Что может взять слон на c3?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "8/8/2pn1B2/4r3/8/8/8/8 w - - 0 1",
    "moves": "f6e5",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "8/1n6/2B5/8/7n/8/2n5/8 w - - 0 1",
    "moves": "c6b7",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "6n1/8/5B2/8/8/5r2/1p6/8 w - - 0 1",
    "moves": "f6b2",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_c2",
    "fen": "8/7r/8/1b6/8/4b3/2B5/8 w - - 0 1",
    "moves": "c2h7",
    "title": "Что может взять слон на c2?"
  },
  {
    "id": "слон_capture_f2",
    "fen": "4n3/1p6/8/2b5/8/8/5B2/8 w - - 0 1",
    "moves": "f2c5",
    "title": "Что может взять слон на f2?"
  },
  {
    "id": "слон_capture_e1",
    "fen": "8/8/8/1n6/7q/8/8/4B1q1 w - - 0 1",
    "moves": "e1h4",
    "title": "Что может взять слон на e1?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/7p/8/8/8/8/3B4/4bn2 w - - 0 1",
    "moves": "d2e1",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/8/8/8/2pb4/8/3B4/2b5 w - - 0 1",
    "moves": "d2c1",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "8/7n/2b5/8/8/8/7n/1B6 w - - 0 1",
    "moves": "b1h7",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_a6",
    "fen": "1r6/8/B7/8/2q5/4b3/8/8 w - - 0 1",
    "moves": "a6c4",
    "title": "Что может взять слон на a6?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "8/3q4/8/2B5/8/q7/8/5b2 w - - 0 1",
    "moves": "c5a3",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_b7",
    "fen": "5q2/1B6/2n5/8/8/7r/8/8 w - - 0 1",
    "moves": "b7c6",
    "title": "Что может взять слон на b7?"
  },
  {
    "id": "слон_capture_g5",
    "fen": "8/8/5q2/6B1/8/8/8/1b1b4 w - - 0 1",
    "moves": "g5f6",
    "title": "Что может взять слон на g5?"
  },
  {
    "id": "слон_capture_c1",
    "fen": "8/8/8/q7/6b1/4p3/8/2B5 w - - 0 1",
    "moves": "c1e3",
    "title": "Что может взять слон на c1?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/5r2/q7/8/8/3Bq3/8/8 w - - 0 1",
    "moves": "d3a6",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_h7",
    "fen": "8/7B/8/q7/6b1/3r4/8/8 w - - 0 1",
    "moves": "h7d3",
    "title": "Что может взять слон на h7?"
  },
  {
    "id": "слон_capture_g7",
    "fen": "8/6B1/8/1b6/8/4p3/8/n7 w - - 0 1",
    "moves": "g7a1",
    "title": "Что может взять слон на g7?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "n7/3p3n/8/8/8/8/8/7B w - - 0 1",
    "moves": "h1a8",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "6n1/2n5/8/8/6n1/6B1/8/8 w - - 0 1",
    "moves": "g3c7",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "8/8/2n5/8/8/8/1q6/5b1B w - - 0 1",
    "moves": "h1c6",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_a8",
    "fen": "B7/8/8/4p3/2b5/5r2/8/8 w - - 0 1",
    "moves": "a8f3",
    "title": "Что может взять слон на a8?"
  },
  {
    "id": "слон_capture_h8",
    "fen": "7B/8/6r1/8/8/8/1r6/7q w - - 0 1",
    "moves": "h8b2",
    "title": "Что может взять слон на h8?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "8/7q/2n5/8/7B/8/5r2/8 w - - 0 1",
    "moves": "h4f2",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_e5",
    "fen": "7q/8/n7/4B3/8/8/8/2r5 w - - 0 1",
    "moves": "e5h8",
    "title": "Что может взять слон на e5?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "8/8/6p1/8/8/8/4b3/1B5n w - - 0 1",
    "moves": "b1g6",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/8/7q/8/6r1/8/3B4/5b2 w - - 0 1",
    "moves": "d2h6",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_c2",
    "fen": "r7/8/5q2/8/8/3b4/2B5/8 w - - 0 1",
    "moves": "c2d3",
    "title": "Что может взять слон на c2?"
  },
  {
    "id": "слон_capture_e8",
    "fen": "q3B3/3n4/8/8/8/7r/8/8 w - - 0 1",
    "moves": "e8d7",
    "title": "Что может взять слон на e8?"
  },
  {
    "id": "слон_capture_e5",
    "fen": "2n5/8/8/4B3/8/7p/1r6/8 w - - 0 1",
    "moves": "e5b2",
    "title": "Что может взять слон на e5?"
  },
  {
    "id": "слон_capture_e4",
    "fen": "8/8/8/5n1n/4B3/8/8/4b3 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять слон на e4?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "8/8/1n6/8/5p2/6B1/4p3/8 w - - 0 1",
    "moves": "g3f4",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_g8",
    "fen": "6B1/8/4b3/n7/1n6/8/8/8 w - - 0 1",
    "moves": "g8e6",
    "title": "Что может взять слон на g8?"
  },
  {
    "id": "слон_capture_d5",
    "fen": "7r/8/8/b2B4/8/5p2/8/8 w - - 0 1",
    "moves": "d5f3",
    "title": "Что может взять слон на d5?"
  },
  {
    "id": "слон_capture_h7",
    "fen": "8/2r4B/8/7q/4n3/8/8/8 w - - 0 1",
    "moves": "h7e4",
    "title": "Что может взять слон на h7?"
  },
  {
    "id": "слон_capture_c7",
    "fen": "5b2/2B5/6p1/4r3/8/8/8/8 w - - 0 1",
    "moves": "c7e5",
    "title": "Что может взять слон на c7?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "1r6/8/7r/5r2/8/8/3B4/8 w - - 0 1",
    "moves": "d2h6",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_h5",
    "fen": "8/7q/8/7B/6n1/8/8/2q5 w - - 0 1",
    "moves": "h5g4",
    "title": "Что может взять слон на h5?"
  },
  {
    "id": "слон_capture_c3",
    "fen": "8/8/8/n7/8/2B5/8/1nn5 w - - 0 1",
    "moves": "c3a5",
    "title": "Что может взять слон на c3?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "8/8/4B1r1/8/2r5/8/8/5n2 w - - 0 1",
    "moves": "e6c4",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "8/6n1/8/2B5/8/r7/4p3/8 w - - 0 1",
    "moves": "c5a3",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/8/8/b7/8/5r2/1p1B4/8 w - - 0 1",
    "moves": "d2a5",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_c4",
    "fen": "8/8/p7/8/2B5/p7/1n6/8 w - - 0 1",
    "moves": "c4a6",
    "title": "Что может взять слон на c4?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "n7/8/8/8/8/8/2q5/1B2q3 w - - 0 1",
    "moves": "b1c2",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_b6",
    "fen": "8/1b6/1B6/8/8/4b3/4b3/8 w - - 0 1",
    "moves": "b6e3",
    "title": "Что может взять слон на b6?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "3r4/7q/6B1/8/6r1/8/8/8 w - - 0 1",
    "moves": "g6h7",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_b5",
    "fen": "8/3r4/7r/1B6/8/6q1/8/8 w - - 0 1",
    "moves": "b5d7",
    "title": "Что может взять слон на b5?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "1r6/8/6B1/7n/8/8/8/7n w - - 0 1",
    "moves": "g6h5",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "5b2/8/6B1/5b2/8/8/4r3/8 w - - 0 1",
    "moves": "g6f5",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "3n4/8/8/2r5/8/8/r7/1B6 w - - 0 1",
    "moves": "b1a2",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_h7",
    "fen": "8/7B/8/5r2/8/r7/8/6n1 w - - 0 1",
    "moves": "h7f5",
    "title": "Что может взять слон на h7?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "1n2b3/8/6B1/8/8/8/8/b7 w - - 0 1",
    "moves": "g6e8",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_e1",
    "fen": "7r/8/8/8/3n4/6n1/8/4B3 w - - 0 1",
    "moves": "e1g3",
    "title": "Что может взять слон на e1?"
  },
  {
    "id": "слон_capture_c3",
    "fen": "8/4p3/8/r7/4p3/2B5/8/8 w - - 0 1",
    "moves": "c3a5",
    "title": "Что может взять слон на c3?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "8/8/8/1p6/8/2q3B1/5r2/8 w - - 0 1",
    "moves": "g3f2",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_e8",
    "fen": "4B3/6b1/2q5/8/8/8/8/1r6 w - - 0 1",
    "moves": "e8c6",
    "title": "Что может взять слон на e8?"
  },
  {
    "id": "слон_capture_c8",
    "fen": "2B5/3b4/8/8/8/8/7q/5q2 w - - 0 1",
    "moves": "c8d7",
    "title": "Что может взять слон на c8?"
  },
  {
    "id": "слон_capture_h8",
    "fen": "n6B/8/8/1q6/8/2b5/8/8 w - - 0 1",
    "moves": "h8c3",
    "title": "Что может взять слон на h8?"
  },
  {
    "id": "слон_capture_d8",
    "fen": "3B4/8/5r2/8/3n4/8/8/6r1 w - - 0 1",
    "moves": "d8f6",
    "title": "Что может взять слон на d8?"
  },
  {
    "id": "слон_capture_d8",
    "fen": "3B4/4n3/8/8/3b4/8/8/1b6 w - - 0 1",
    "moves": "d8e7",
    "title": "Что может взять слон на d8?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "2n5/8/2B5/5p2/8/5n2/8/8 w - - 0 1",
    "moves": "c6f3",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_g7",
    "fen": "8/6B1/2b2b2/8/8/8/4r3/8 w - - 0 1",
    "moves": "g7f6",
    "title": "Что может взять слон на g7?"
  },
  {
    "id": "слон_capture_a5",
    "fen": "8/2r5/8/B7/5p2/8/7p/8 w - - 0 1",
    "moves": "a5c7",
    "title": "Что может взять слон на a5?"
  },
  {
    "id": "слон_capture_d6",
    "fen": "7n/b7/3B4/8/5n2/8/8/8 w - - 0 1",
    "moves": "d6f4",
    "title": "Что может взять слон на d6?"
  },
  {
    "id": "слон_capture_h8",
    "fen": "7B/8/8/8/3p2b1/3b4/8/8 w - - 0 1",
    "moves": "h8d4",
    "title": "Что может взять слон на h8?"
  },
  {
    "id": "слон_capture_e8",
    "fen": "4B3/8/8/1q6/7r/8/2n5/8 w - - 0 1",
    "moves": "e8b5",
    "title": "Что может взять слон на e8?"
  },
  {
    "id": "слон_capture_b5",
    "fen": "8/3b4/8/1B6/8/2p5/7q/8 w - - 0 1",
    "moves": "b5d7",
    "title": "Что может взять слон на b5?"
  },
  {
    "id": "слон_capture_a2",
    "fen": "8/5r2/8/8/8/n7/B3n3/8 w - - 0 1",
    "moves": "a2f7",
    "title": "Что может взять слон на a2?"
  },
  {
    "id": "слон_capture_f8",
    "fen": "5B2/8/3n4/4r3/8/8/8/n7 w - - 0 1",
    "moves": "f8d6",
    "title": "Что может взять слон на f8?"
  },
  {
    "id": "слон_capture_g6",
    "fen": "8/7r/6B1/2r5/8/8/1r6/8 w - - 0 1",
    "moves": "g6h7",
    "title": "Что может взять слон на g6?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "4r3/8/3b4/p7/8/6B1/8/8 w - - 0 1",
    "moves": "g3d6",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/8/8/q7/2r5/8/3B1r2/8 w - - 0 1",
    "moves": "d2a5",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_a2",
    "fen": "8/8/4b3/8/4p3/6q1/B7/8 w - - 0 1",
    "moves": "a2e6",
    "title": "Что может взять слон на a2?"
  },
  {
    "id": "слон_capture_d8",
    "fen": "q2B4/4p3/8/8/6q1/8/8/8 w - - 0 1",
    "moves": "d8e7",
    "title": "Что может взять слон на d8?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "8/1b6/1bB5/8/8/8/8/4b3 w - - 0 1",
    "moves": "c6b7",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_h6",
    "fen": "8/8/3r3B/6q1/1p6/8/8/8 w - - 0 1",
    "moves": "h6g5",
    "title": "Что может взять слон на h6?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/8/8/8/1b3n2/3B4/8/1b6 w - - 0 1",
    "moves": "d3b1",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_a4",
    "fen": "4n3/8/8/4n3/B7/8/8/7r w - - 0 1",
    "moves": "a4e8",
    "title": "Что может взять слон на a4?"
  },
  {
    "id": "слон_capture_a6",
    "fen": "n7/1n4n1/B7/8/8/8/8/8 w - - 0 1",
    "moves": "a6b7",
    "title": "Что может взять слон на a6?"
  },
  {
    "id": "слон_capture_e7",
    "fen": "8/2q1B3/5n2/8/8/4n3/8/8 w - - 0 1",
    "moves": "e7f6",
    "title": "Что может взять слон на e7?"
  },
  {
    "id": "слон_capture_f3",
    "fen": "5b2/8/8/8/4r3/5Bp1/8/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять слон на f3?"
  },
  {
    "id": "слон_capture_f3",
    "fen": "8/r7/3r4/8/6b1/5B2/8/8 w - - 0 1",
    "moves": "f3g4",
    "title": "Что может взять слон на f3?"
  },
  {
    "id": "слон_capture_c2",
    "fen": "2r5/8/8/8/8/3p4/2B5/6n1 w - - 0 1",
    "moves": "c2d3",
    "title": "Что может взять слон на c2?"
  },
  {
    "id": "слон_capture_a3",
    "fen": "8/8/8/5p2/1b6/B7/6b1/8 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять слон на a3?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "8/8/r4B2/8/3b4/8/8/4r3 w - - 0 1",
    "moves": "f6d4",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "8/8/1q6/8/4r3/8/7n/7B w - - 0 1",
    "moves": "h1e4",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_f8",
    "fen": "5B2/4n3/5n2/8/8/8/8/6n1 w - - 0 1",
    "moves": "f8e7",
    "title": "Что может взять слон на f8?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "8/4n2b/8/8/7B/1n6/8/8 w - - 0 1",
    "moves": "h4e7",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_b3",
    "fen": "7b/4p3/8/8/8/1B6/2q5/8 w - - 0 1",
    "moves": "b3c2",
    "title": "Что может взять слон на b3?"
  },
  {
    "id": "слон_capture_a5",
    "fen": "5b2/2r5/8/B7/4r3/8/8/8 w - - 0 1",
    "moves": "a5c7",
    "title": "Что может взять слон на a5?"
  },
  {
    "id": "слон_capture_e3",
    "fen": "8/8/1n2b3/8/7b/4B3/8/8 w - - 0 1",
    "moves": "e3b6",
    "title": "Что может взять слон на e3?"
  },
  {
    "id": "слон_capture_d2",
    "fen": "8/8/3b4/8/8/8/3B4/3nn3 w - - 0 1",
    "moves": "d2e1",
    "title": "Что может взять слон на d2?"
  },
  {
    "id": "слон_capture_b6",
    "fen": "3r4/8/1B6/8/8/6b1/8/1n6 w - - 0 1",
    "moves": "b6d8",
    "title": "Что может взять слон на b6?"
  },
  {
    "id": "слон_capture_h8",
    "fen": "1n5B/8/4bn2/8/8/8/8/8 w - - 0 1",
    "moves": "h8f6",
    "title": "Что может взять слон на h8?"
  },
  {
    "id": "слон_capture_b6",
    "fen": "8/8/1B6/8/8/8/3b4/n5n1 w - - 0 1",
    "moves": "b6g1",
    "title": "Что может взять слон на b6?"
  },
  {
    "id": "слон_capture_c1",
    "fen": "4n3/8/8/7r/8/8/1n6/2B5 w - - 0 1",
    "moves": "c1b2",
    "title": "Что может взять слон на c1?"
  },
  {
    "id": "слон_capture_c7",
    "fen": "2n1b3/2B5/8/8/8/8/7q/8 w - - 0 1",
    "moves": "c7h2",
    "title": "Что может взять слон на c7?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "b4n2/8/4B3/8/8/7r/8/8 w - - 0 1",
    "moves": "e6h3",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/8/8/6p1/1q6/3B4/2r5/8 w - - 0 1",
    "moves": "d3c2",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_a5",
    "fen": "8/6p1/8/B7/8/8/3q4/5r2 w - - 0 1",
    "moves": "a5d2",
    "title": "Что может взять слон на a5?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "3n4/8/4B3/2q5/8/7b/8/8 w - - 0 1",
    "moves": "e6h3",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_h5",
    "fen": "2n1b3/8/8/7B/4p3/8/8/8 w - - 0 1",
    "moves": "h5e8",
    "title": "Что может взять слон на h5?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "5n2/8/1q6/6r1/7B/8/8/8 w - - 0 1",
    "moves": "h4g5",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_d5",
    "fen": "8/8/5q2/3B4/2n5/6r1/8/8 w - - 0 1",
    "moves": "d5c4",
    "title": "Что может взять слон на d5?"
  },
  {
    "id": "слон_capture_c4",
    "fen": "1q6/6n1/8/8/2B5/8/8/5n2 w - - 0 1",
    "moves": "c4f1",
    "title": "Что может взять слон на c4?"
  },
  {
    "id": "слон_capture_f7",
    "fen": "8/1n3B2/6q1/8/8/r7/8/8 w - - 0 1",
    "moves": "f7g6",
    "title": "Что может взять слон на f7?"
  },
  {
    "id": "слон_capture_b5",
    "fen": "8/2b5/8/1B6/7p/8/8/5n2 w - - 0 1",
    "moves": "b5f1",
    "title": "Что может взять слон на b5?"
  },
  {
    "id": "слон_capture_g4",
    "fen": "5r2/8/4r3/p7/6B1/8/8/8 w - - 0 1",
    "moves": "g4e6",
    "title": "Что может взять слон на g4?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "2n5/7p/8/3n4/8/8/8/7B w - - 0 1",
    "moves": "h1d5",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_e7",
    "fen": "8/4B3/3r4/8/8/8/1bb5/8 w - - 0 1",
    "moves": "e7d6",
    "title": "Что может взять слон на e7?"
  },
  {
    "id": "слон_capture_e5",
    "fen": "8/8/2q5/4B3/8/6b1/4b3/8 w - - 0 1",
    "moves": "e5g3",
    "title": "Что может взять слон на e5?"
  },
  {
    "id": "слон_capture_b2",
    "fen": "8/8/6n1/8/8/p7/1B5q/8 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять слон на b2?"
  },
  {
    "id": "слон_capture_g8",
    "fen": "1n4B1/5n2/8/8/8/8/7r/8 w - - 0 1",
    "moves": "g8f7",
    "title": "Что может взять слон на g8?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "n7/8/2B4p/8/8/3b4/8/8 w - - 0 1",
    "moves": "c6a8",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_d5",
    "fen": "8/5b2/8/3B4/8/8/1b6/1n6 w - - 0 1",
    "moves": "d5f7",
    "title": "Что может взять слон на d5?"
  },
  {
    "id": "слон_capture_a2",
    "fen": "8/7n/8/8/8/1n4n1/B7/8 w - - 0 1",
    "moves": "a2b3",
    "title": "Что может взять слон на a2?"
  },
  {
    "id": "слон_capture_h7",
    "fen": "8/7B/3r4/8/4b3/8/8/2n5 w - - 0 1",
    "moves": "h7e4",
    "title": "Что может взять слон на h7?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "8/8/5q2/b7/7B/8/8/1q6 w - - 0 1",
    "moves": "h4f6",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "8/8/8/2B4p/2r5/q7/8/8 w - - 0 1",
    "moves": "c5a3",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "8/8/2r5/2B5/8/8/3q4/6q1 w - - 0 1",
    "moves": "c5g1",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_c6",
    "fen": "1n6/8/2B5/8/4b3/b7/8/8 w - - 0 1",
    "moves": "c6e4",
    "title": "Что может взять слон на c6?"
  },
  {
    "id": "слон_capture_h6",
    "fen": "2n5/8/7B/6p1/8/8/8/3q4 w - - 0 1",
    "moves": "h6g5",
    "title": "Что может взять слон на h6?"
  },
  {
    "id": "слон_capture_e1",
    "fen": "8/8/5r2/8/1r6/8/p7/4B3 w - - 0 1",
    "moves": "e1b4",
    "title": "Что может взять слон на e1?"
  },
  {
    "id": "слон_capture_h5",
    "fen": "4n3/8/8/7B/4p3/8/8/6q1 w - - 0 1",
    "moves": "h5e8",
    "title": "Что может взять слон на h5?"
  },
  {
    "id": "слон_capture_c1",
    "fen": "8/8/2b5/8/5r2/8/8/2B1r3 w - - 0 1",
    "moves": "c1f4",
    "title": "Что может взять слон на c1?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "8/2n5/5r2/8/7B/3q4/8/8 w - - 0 1",
    "moves": "h4f6",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_g2",
    "fen": "3n4/8/8/1r6/8/8/6B1/7q w - - 0 1",
    "moves": "g2h1",
    "title": "Что может взять слон на g2?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/8/1n6/8/4b3/3B4/8/3q4 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "8/8/5B2/1n2n3/8/8/2n5/8 w - - 0 1",
    "moves": "f6e5",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_e7",
    "fen": "8/4B3/8/q7/7q/8/8/6b1 w - - 0 1",
    "moves": "e7h4",
    "title": "Что может взять слон на e7?"
  },
  {
    "id": "слон_capture_f6",
    "fen": "b7/8/5B2/8/8/6n1/1b6/8 w - - 0 1",
    "moves": "f6b2",
    "title": "Что может взять слон на f6?"
  },
  {
    "id": "слон_capture_g7",
    "fen": "2n5/6B1/8/8/4r3/8/8/n7 w - - 0 1",
    "moves": "g7a1",
    "title": "Что может взять слон на g7?"
  },
  {
    "id": "слон_capture_a8",
    "fen": "B5b1/8/8/2b5/8/5b2/8/8 w - - 0 1",
    "moves": "a8f3",
    "title": "Что может взять слон на a8?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "1r6/8/8/7r/8/3q2B1/8/8 w - - 0 1",
    "moves": "g3b8",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_a5",
    "fen": "8/2q5/8/B7/3q4/8/8/7n w - - 0 1",
    "moves": "a5c7",
    "title": "Что может взять слон на a5?"
  },
  {
    "id": "слон_capture_g3",
    "fen": "3n4/8/8/p3p3/8/6B1/8/8 w - - 0 1",
    "moves": "g3e5",
    "title": "Что может взять слон на g3?"
  },
  {
    "id": "слон_capture_b7",
    "fen": "2q5/1B6/6p1/8/8/8/8/5n2 w - - 0 1",
    "moves": "b7c8",
    "title": "Что может взять слон на b7?"
  },
  {
    "id": "слон_capture_f8",
    "fen": "5B2/7p/8/2n5/8/8/8/4n3 w - - 0 1",
    "moves": "f8c5",
    "title": "Что может взять слон на f8?"
  },
  {
    "id": "слон_capture_a1",
    "fen": "7b/3n4/8/8/8/8/n7/B7 w - - 0 1",
    "moves": "a1h8",
    "title": "Что может взять слон на a1?"
  },
  {
    "id": "слон_capture_h4",
    "fen": "8/8/5p2/8/q6B/8/8/6q1 w - - 0 1",
    "moves": "h4f6",
    "title": "Что может взять слон на h4?"
  },
  {
    "id": "слон_capture_h1",
    "fen": "8/8/8/8/4p3/7p/1q6/7B w - - 0 1",
    "moves": "h1e4",
    "title": "Что может взять слон на h1?"
  },
  {
    "id": "слон_capture_h6",
    "fen": "8/8/7B/6q1/2q5/8/1p6/8 w - - 0 1",
    "moves": "h6g5",
    "title": "Что может взять слон на h6?"
  },
  {
    "id": "слон_capture_c5",
    "fen": "8/8/6b1/2B5/8/4p3/1r6/8 w - - 0 1",
    "moves": "c5e3",
    "title": "Что может взять слон на c5?"
  },
  {
    "id": "слон_capture_b1",
    "fen": "8/8/4p3/8/5r2/8/2p5/1B6 w - - 0 1",
    "moves": "b1c2",
    "title": "Что может взять слон на b1?"
  },
  {
    "id": "слон_capture_d3",
    "fen": "8/8/5r2/1n6/8/3B4/3p4/8 w - - 0 1",
    "moves": "d3b5",
    "title": "Что может взять слон на d3?"
  },
  {
    "id": "слон_capture_e6",
    "fen": "1b3b2/8/4B3/8/6r1/8/8/8 w - - 0 1",
    "moves": "e6g4",
    "title": "Что может взять слон на e6?"
  },
  {
    "id": "слон_capture_b4",
    "fen": "7q/2q5/8/8/1B6/8/3q4/8 w - - 0 1",
    "moves": "b4d2",
    "title": "Что может взять слон на b4?"
  },
  {
    "id": "слон_capture_g1",
    "fen": "8/8/1b6/8/8/1b6/6b1/6B1 w - - 0 1",
    "moves": "g1b6",
    "title": "Что может взять слон на g1?"
  },
  {
    "id": "слон_capture_b5",
    "fen": "8/8/q7/1B6/3b4/8/8/2n5 w - - 0 1",
    "moves": "b5a6",
    "title": "Что может взять слон на b5?"
  },
  {
    "id": "слон_capture_a2",
    "fen": "8/3r4/8/8/2n5/2n5/B7/8 w - - 0 1",
    "moves": "a2c4",
    "title": "Что может взять слон на a2?"
  },
  {
    "id": "слон_capture_e2",
    "fen": "8/7r/n7/8/8/8/4B1n1/8 w - - 0 1",
    "moves": "e2a6",
    "title": "Что может взять слон на e2?"
  }
];