window.PawnCaptureProblems = [
  {
    "id": "пешка_capture_g2",
    "fen": "8/8/8/2n5/8/5q2/2b3P1/8 w - - 0 1",
    "moves": "g2f3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "6b1/8/3q4/2P5/8/8/8/6b1 w - - 0 1",
    "moves": "c5d6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/3r4/8/8/8/1n6/2P5/5n2 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_f5",
    "fen": "7b/8/4q3/5P2/8/6b1/8/8 w - - 0 1",
    "moves": "f5e6",
    "title": "Что может взять пешка на f5?"
  },
  {
    "id": "пешка_capture_h5",
    "fen": "8/8/6q1/7P/8/8/5p2/2r5 w - - 0 1",
    "moves": "h5g6",
    "title": "Что может взять пешка на h5?"
  },
  {
    "id": "пешка_capture_e3",
    "fen": "8/8/8/8/5p1n/4P3/8/6r1 w - - 0 1",
    "moves": "e3f4",
    "title": "Что может взять пешка на e3?"
  },
  {
    "id": "пешка_capture_c7",
    "fen": "3n4/2P5/8/8/5r2/b7/8/8 w - - 0 1",
    "moves": "c7d8",
    "title": "Что может взять пешка на c7?"
  },
  {
    "id": "пешка_capture_a3",
    "fen": "6q1/3n4/8/8/1q6/P7/8/8 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять пешка на a3?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1n6/P7/8/8/3n4/p7/8/8 w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_h7",
    "fen": "6n1/7P/8/8/8/8/7p/3n4 w - - 0 1",
    "moves": "h7g8",
    "title": "Что может взять пешка на h7?"
  },
  {
    "id": "пешка_capture_a4",
    "fen": "7b/8/8/1b3n2/P7/8/8/8 w - - 0 1",
    "moves": "a4b5",
    "title": "Что может взять пешка на a4?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1r6/P4n2/b7/8/8/8/8/8 w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "8/8/8/8/1q6/5b2/6P1/2q5 w - - 0 1",
    "moves": "g2f3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_a6",
    "fen": "8/pp6/P7/8/8/8/3n4/8 w - - 0 1",
    "moves": "a6b7",
    "title": "Что может взять пешка на a6?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/4b3/8/5p2/8/1r6/2P5/8 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_e3",
    "fen": "8/8/r7/8/3r4/4P3/6r1/8 w - - 0 1",
    "moves": "e3d4",
    "title": "Что может взять пешка на e3?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "8/8/8/8/5b2/5b2/4P3/n7 w - - 0 1",
    "moves": "e2f3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_g3",
    "fen": "8/8/5r2/8/7r/6P1/8/n7 w - - 0 1",
    "moves": "g3h4",
    "title": "Что может взять пешка на g3?"
  },
  {
    "id": "пешка_capture_a3",
    "fen": "3q4/8/8/8/1p6/P3q3/8/8 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять пешка на a3?"
  },
  {
    "id": "пешка_capture_a6",
    "fen": "8/1q6/P5n1/8/8/8/8/n7 w - - 0 1",
    "moves": "a6b7",
    "title": "Что может взять пешка на a6?"
  },
  {
    "id": "пешка_capture_g7",
    "fen": "5n2/6P1/8/8/8/8/3q4/7r w - - 0 1",
    "moves": "g7f8",
    "title": "Что может взять пешка на g7?"
  },
  {
    "id": "пешка_capture_g7",
    "fen": "5n2/6P1/7p/p7/8/8/8/8 w - - 0 1",
    "moves": "g7f8",
    "title": "Что может взять пешка на g7?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "1r6/8/8/8/4p3/3P4/5p2/8 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_c7",
    "fen": "1n6/2P5/8/8/8/8/4n3/b7 w - - 0 1",
    "moves": "c7b8",
    "title": "Что может взять пешка на c7?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1b6/P7/8/p7/8/8/8/7r w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_d5",
    "fen": "8/1b6/4q3/3P3p/8/8/8/8 w - - 0 1",
    "moves": "d5e6",
    "title": "Что может взять пешка на d5?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "1n6/8/8/3n4/4P3/5n2/8/8 w - - 0 1",
    "moves": "e4d5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/8/8/8/6b1/5P2/2p5/6n1 w - - 0 1",
    "moves": "f3g4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "6q1/3b4/8/8/8/5b2/4P3/8 w - - 0 1",
    "moves": "e2f3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_g7",
    "fen": "7n/6P1/8/5q2/7b/8/8/8 w - - 0 1",
    "moves": "g7h8",
    "title": "Что может взять пешка на g7?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "2q5/3P4/8/8/8/r7/8/6r1 w - - 0 1",
    "moves": "d7c8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_g5",
    "fen": "8/8/7n/6P1/8/r7/5p2/8 w - - 0 1",
    "moves": "g5h6",
    "title": "Что может взять пешка на g5?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/8/6r1/8/8/1r6/2P5/4q3 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "8/8/2pn4/2P5/8/8/8/1n6 w - - 0 1",
    "moves": "c5d6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "3r4/8/8/8/8/5b2/4P3/1q6 w - - 0 1",
    "moves": "e2f3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "4n3/8/8/5b2/3qP3/8/8/8 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_f4",
    "fen": "8/8/8/6q1/3n1P2/8/8/4q3 w - - 0 1",
    "moves": "f4g5",
    "title": "Что может взять пешка на f4?"
  },
  {
    "id": "пешка_capture_e6",
    "fen": "8/3n4/2r1P3/8/8/8/5q2/8 w - - 0 1",
    "moves": "e6d7",
    "title": "Что может взять пешка на e6?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/8/7n/8/3q4/n7/1P6/8 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_d5",
    "fen": "8/8/4n3/3P1n2/8/8/4n3/8 w - - 0 1",
    "moves": "d5e6",
    "title": "Что может взять пешка на d5?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "8/8/1b6/2P5/7b/3r4/8/8 w - - 0 1",
    "moves": "c5b6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/8/7n/8/8/q7/1P6/1b6 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/2r5/3P4/8/4q3/1b6/8/8 w - - 0 1",
    "moves": "d6c7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_h3",
    "fen": "4r3/8/8/3b4/6r1/7P/8/8 w - - 0 1",
    "moves": "h3g4",
    "title": "Что может взять пешка на h3?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/4q3/3P4/8/3r4/8/8/5n2 w - - 0 1",
    "moves": "d6e7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "8/4b3/2b5/8/3r4/2P5/8/8 w - - 0 1",
    "moves": "c3d4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/8/8/4n3/3P4/1b6/5r2 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/8/2p5/5r2/3qP3/8/8/8 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_a6",
    "fen": "8/1p5n/P7/8/8/8/q7/8 w - - 0 1",
    "moves": "a6b7",
    "title": "Что может взять пешка на a6?"
  },
  {
    "id": "пешка_capture_b7",
    "fen": "2n2n2/1P6/8/8/8/8/8/1q6 w - - 0 1",
    "moves": "b7c8",
    "title": "Что может взять пешка на b7?"
  },
  {
    "id": "пешка_capture_c4",
    "fen": "8/7p/8/3n4/2P5/8/8/2q5 w - - 0 1",
    "moves": "c4d5",
    "title": "Что может взять пешка на c4?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/8/8/3b4/4P3/3b4/1p6/8 w - - 0 1",
    "moves": "e4d5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_b4",
    "fen": "8/8/5q2/q7/1P6/6q1/8/8 w - - 0 1",
    "moves": "b4a5",
    "title": "Что может взять пешка на b4?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "6b1/8/8/6n1/3r4/2P5/8/8 w - - 0 1",
    "moves": "c3d4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/3p4/8/4r3/3P4/8/b7 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_g5",
    "fen": "2n5/8/7b/6P1/1q6/8/8/8 w - - 0 1",
    "moves": "g5h6",
    "title": "Что может взять пешка на g5?"
  },
  {
    "id": "пешка_capture_b7",
    "fen": "2r5/1P6/8/8/r7/8/8/4b3 w - - 0 1",
    "moves": "b7c8",
    "title": "Что может взять пешка на b7?"
  },
  {
    "id": "пешка_capture_f6",
    "fen": "8/4q3/5P2/5r2/8/8/1p6/8 w - - 0 1",
    "moves": "f6e7",
    "title": "Что может взять пешка на f6?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/3b4/6r1/8/8/2p5/1P6/8 w - - 0 1",
    "moves": "b2c3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "4r3/3P4/8/b7/8/8/8/b7 w - - 0 1",
    "moves": "d7e8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_g3",
    "fen": "8/1b6/8/8/7q/6P1/8/3q4 w - - 0 1",
    "moves": "g3h4",
    "title": "Что может взять пешка на g3?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "8/7r/4r3/8/3q4/2P5/8/8 w - - 0 1",
    "moves": "c3d4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/8/4n3/8/8/1n4b1/2P5/8 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_d2",
    "fen": "8/5b2/8/8/8/2b5/3P4/6b1 w - - 0 1",
    "moves": "d2c3",
    "title": "Что может взять пешка на d2?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "7r/8/8/8/8/5q2/3b2P1/8 w - - 0 1",
    "moves": "g2f3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/8/7b/2q5/6b1/5P2/8/8 w - - 0 1",
    "moves": "f3g4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "4n3/3P4/8/3b4/6r1/8/8/8 w - - 0 1",
    "moves": "d7e8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_g4",
    "fen": "8/8/8/7p/6P1/6r1/2r5/8 w - - 0 1",
    "moves": "g4h5",
    "title": "Что может взять пешка на g4?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "3r4/2n5/8/8/8/5p2/6P1/8 w - - 0 1",
    "moves": "g2f3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_e7",
    "fen": "3b4/4P3/8/8/3p4/8/8/6n1 w - - 0 1",
    "moves": "e7d8",
    "title": "Что может взять пешка на e7?"
  },
  {
    "id": "пешка_capture_e7",
    "fen": "5r2/4P3/8/8/3p4/8/r7/8 w - - 0 1",
    "moves": "e7f8",
    "title": "Что может взять пешка на e7?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "3b4/8/8/8/8/3b1n2/6P1/8 w - - 0 1",
    "moves": "g2f3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_g5",
    "fen": "8/8/7r/2p3P1/8/8/1b6/8 w - - 0 1",
    "moves": "g5h6",
    "title": "Что может взять пешка на g5?"
  },
  {
    "id": "пешка_capture_c4",
    "fen": "8/6p1/8/3r4/2P3n1/8/8/8 w - - 0 1",
    "moves": "c4d5",
    "title": "Что может взять пешка на c4?"
  },
  {
    "id": "пешка_capture_h7",
    "fen": "6n1/1q5P/8/5b2/8/8/8/8 w - - 0 1",
    "moves": "h7g8",
    "title": "Что может взять пешка на h7?"
  },
  {
    "id": "пешка_capture_g6",
    "fen": "8/5r2/1n4P1/8/4q3/8/8/8 w - - 0 1",
    "moves": "g6f7",
    "title": "Что может взять пешка на g6?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "2n5/3P4/8/q7/8/3q4/8/8 w - - 0 1",
    "moves": "d7c8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "8/8/8/b7/n7/3b4/4P3/8 w - - 0 1",
    "moves": "e2d3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_h7",
    "fen": "6n1/7P/8/8/8/p4n2/8/8 w - - 0 1",
    "moves": "h7g8",
    "title": "Что может взять пешка на h7?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "4n3/3P3r/8/8/8/8/8/q7 w - - 0 1",
    "moves": "d7e8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_e3",
    "fen": "n7/8/8/8/5q2/4P3/8/1b6 w - - 0 1",
    "moves": "e3f4",
    "title": "Что может взять пешка на e3?"
  },
  {
    "id": "пешка_capture_f4",
    "fen": "8/8/5p2/6r1/5P2/2n5/8/8 w - - 0 1",
    "moves": "f4g5",
    "title": "Что может взять пешка на f4?"
  },
  {
    "id": "пешка_capture_e5",
    "fen": "4q3/8/3p4/4P3/8/8/8/3n4 w - - 0 1",
    "moves": "e5d6",
    "title": "Что может взять пешка на e5?"
  },
  {
    "id": "пешка_capture_f7",
    "fen": "4r3/5P2/8/8/7q/8/8/5n2 w - - 0 1",
    "moves": "f7e8",
    "title": "Что может взять пешка на f7?"
  },
  {
    "id": "пешка_capture_b6",
    "fen": "8/2b5/1P6/8/8/7r/1p6/8 w - - 0 1",
    "moves": "b6c7",
    "title": "Что может взять пешка на b6?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/n7/4p3/4p3/3P4/8/8 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "4b3/1p6/8/8/4p3/5P2/8/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_d4",
    "fen": "8/8/8/p3n3/3P4/8/2p5/8 w - - 0 1",
    "moves": "d4e5",
    "title": "Что может взять пешка на d4?"
  },
  {
    "id": "пешка_capture_f4",
    "fen": "8/1b6/8/6r1/5P2/r7/8/8 w - - 0 1",
    "moves": "f4g5",
    "title": "Что может взять пешка на f4?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "6r1/8/8/8/4b3/5P2/1q6/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "2q5/8/8/8/4n3/3P4/8/q7 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_a4",
    "fen": "8/6p1/8/1q6/P7/8/8/4n3 w - - 0 1",
    "moves": "a4b5",
    "title": "Что может взять пешка на a4?"
  },
  {
    "id": "пешка_capture_b6",
    "fen": "8/r7/1P6/8/8/2b5/7q/8 w - - 0 1",
    "moves": "b6a7",
    "title": "Что может взять пешка на b6?"
  },
  {
    "id": "пешка_capture_d2",
    "fen": "2q5/8/6p1/8/8/4q3/3P4/8 w - - 0 1",
    "moves": "d2e3",
    "title": "Что может взять пешка на d2?"
  },
  {
    "id": "пешка_capture_f6",
    "fen": "6r1/4r3/5P2/8/8/1r6/8/8 w - - 0 1",
    "moves": "f6e7",
    "title": "Что может взять пешка на f6?"
  },
  {
    "id": "пешка_capture_h6",
    "fen": "3q4/6b1/b6P/8/8/8/8/8 w - - 0 1",
    "moves": "h6g7",
    "title": "Что может взять пешка на h6?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/1p6/8/7n/8/n7/1P6/8 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/4q3/3P4/q7/8/1r6/8/8 w - - 0 1",
    "moves": "d6e7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/8/6r1/4p3/4n3/5P2/8/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "n7/b7/8/8/8/5n2/4P3/8 w - - 0 1",
    "moves": "e2f3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/8/8/8/4r3/5P2/q7/5b2 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_d5",
    "fen": "8/8/4n3/3P4/8/8/4n3/1n6 w - - 0 1",
    "moves": "d5e6",
    "title": "Что может взять пешка на d5?"
  },
  {
    "id": "пешка_capture_g4",
    "fen": "6n1/8/8/5q2/6P1/8/8/6n1 w - - 0 1",
    "moves": "g4f5",
    "title": "Что может взять пешка на g4?"
  },
  {
    "id": "пешка_capture_h7",
    "fen": "6b1/7P/5r2/8/8/8/8/7n w - - 0 1",
    "moves": "h7g8",
    "title": "Что может взять пешка на h7?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "8/8/8/8/8/4b2n/6P1/1b6 w - - 0 1",
    "moves": "g2h3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/8/7b/8/8/1r6/2P5/b7 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/8/8/5n2/4P3/8/5b2/1r6 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_a3",
    "fen": "n7/8/8/8/bb6/P7/8/8 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять пешка на a3?"
  },
  {
    "id": "пешка_capture_h2",
    "fen": "8/5q2/8/8/8/6p1/2b4P/8 w - - 0 1",
    "moves": "h2g3",
    "title": "Что может взять пешка на h2?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1r6/P4n2/8/8/8/q7/8/8 w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_f2",
    "fen": "3q4/8/8/8/8/6n1/5P2/b7 w - - 0 1",
    "moves": "f2g3",
    "title": "Что может взять пешка на f2?"
  },
  {
    "id": "пешка_capture_b4",
    "fen": "1b6/8/5p2/p7/1P6/8/8/8 w - - 0 1",
    "moves": "b4a5",
    "title": "Что может взять пешка на b4?"
  },
  {
    "id": "пешка_capture_e5",
    "fen": "8/8/5p2/b3P3/8/8/5n2/8 w - - 0 1",
    "moves": "e5f6",
    "title": "Что может взять пешка на e5?"
  },
  {
    "id": "пешка_capture_b3",
    "fen": "5n2/8/8/p7/2p5/1P6/8/8 w - - 0 1",
    "moves": "b3c4",
    "title": "Что может взять пешка на b3?"
  },
  {
    "id": "пешка_capture_g5",
    "fen": "2n5/7q/5r2/6P1/8/8/8/8 w - - 0 1",
    "moves": "g5f6",
    "title": "Что может взять пешка на g5?"
  },
  {
    "id": "пешка_capture_b5",
    "fen": "8/8/2n5/1P6/8/6p1/8/4r3 w - - 0 1",
    "moves": "b5c6",
    "title": "Что может взять пешка на b5?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/8/8/8/6b1/5P2/8/6nb w - - 0 1",
    "moves": "f3g4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/2r5/3P4/n7/8/4p3/8/8 w - - 0 1",
    "moves": "d6c7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_d4",
    "fen": "8/8/8/4b3/3P3p/8/8/4n3 w - - 0 1",
    "moves": "d4e5",
    "title": "Что может взять пешка на d4?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "8/8/8/8/7p/3q4/2P4p/8 w - - 0 1",
    "moves": "c2d3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_d7",
    "fen": "4b3/3P4/8/8/5b2/8/6p1/8 w - - 0 1",
    "moves": "d7e8",
    "title": "Что может взять пешка на d7?"
  },
  {
    "id": "пешка_capture_a2",
    "fen": "n7/8/8/8/8/1b6/P5r1/8 w - - 0 1",
    "moves": "a2b3",
    "title": "Что может взять пешка на a2?"
  },
  {
    "id": "пешка_capture_f2",
    "fen": "8/8/2n5/8/7r/6n1/5P2/8 w - - 0 1",
    "moves": "f2g3",
    "title": "Что может взять пешка на f2?"
  },
  {
    "id": "пешка_capture_e2",
    "fen": "2r5/8/8/1n6/8/3r4/4P3/8 w - - 0 1",
    "moves": "e2d3",
    "title": "Что может взять пешка на e2?"
  },
  {
    "id": "пешка_capture_c7",
    "fen": "1q6/2P1b3/8/3r4/8/8/8/8 w - - 0 1",
    "moves": "c7b8",
    "title": "Что может взять пешка на c7?"
  },
  {
    "id": "пешка_capture_a6",
    "fen": "8/1n6/P7/8/8/5r2/8/7n w - - 0 1",
    "moves": "a6b7",
    "title": "Что может взять пешка на a6?"
  },
  {
    "id": "пешка_capture_f4",
    "fen": "8/8/8/6q1/5P2/2p5/8/7n w - - 0 1",
    "moves": "f4g5",
    "title": "Что может взять пешка на f4?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/8/8/2b5/b2P4/8/n7 w - - 0 1",
    "moves": "d3c4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_g6",
    "fen": "8/7q/2p3P1/8/1r6/8/8/8 w - - 0 1",
    "moves": "g6h7",
    "title": "Что может взять пешка на g6?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/8/4q3/2b5/3P4/3b4/8 w - - 0 1",
    "moves": "d3c4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/8/8/5r2/4P2q/8/1q6/8 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "8/8/8/8/1p4b1/2Pq4/8/8 w - - 0 1",
    "moves": "c3b4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_f5",
    "fen": "8/6p1/4r3/n4P2/8/8/8/8 w - - 0 1",
    "moves": "f5e6",
    "title": "Что может взять пешка на f5?"
  },
  {
    "id": "пешка_capture_e5",
    "fen": "8/8/5b2/4P3/8/7r/8/3q4 w - - 0 1",
    "moves": "e5f6",
    "title": "Что может взять пешка на e5?"
  },
  {
    "id": "пешка_capture_g7",
    "fen": "5n2/6P1/2p5/8/3b4/8/8/8 w - - 0 1",
    "moves": "g7f8",
    "title": "Что может взять пешка на g7?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "3n4/3b4/8/8/4q3/5P2/8/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/8/2p5/7b/8/2p5/1P6/8 w - - 0 1",
    "moves": "b2c3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_f7",
    "fen": "4n3/5P2/r7/2q5/8/8/8/8 w - - 0 1",
    "moves": "f7e8",
    "title": "Что может взять пешка на f7?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/1r6/8/3n4/4P3/8/8/6b1 w - - 0 1",
    "moves": "e4d5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "8/8/1n6/2P5/8/2p5/5p2/8 w - - 0 1",
    "moves": "c5b6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_h6",
    "fen": "2n5/6r1/7P/8/8/8/8/n7 w - - 0 1",
    "moves": "h6g7",
    "title": "Что может взять пешка на h6?"
  },
  {
    "id": "пешка_capture_h3",
    "fen": "8/8/8/2b5/6n1/7P/8/5q2 w - - 0 1",
    "moves": "h3g4",
    "title": "Что может взять пешка на h3?"
  },
  {
    "id": "пешка_capture_g4",
    "fen": "8/3r4/8/7n/6P1/8/8/1n6 w - - 0 1",
    "moves": "g4h5",
    "title": "Что может взять пешка на g4?"
  },
  {
    "id": "пешка_capture_e6",
    "fen": "8/3q4/4P3/8/5b1b/8/8/8 w - - 0 1",
    "moves": "e6d7",
    "title": "Что может взять пешка на e6?"
  },
  {
    "id": "пешка_capture_c6",
    "fen": "8/3r4/2P5/8/8/8/5q2/7b w - - 0 1",
    "moves": "c6d7",
    "title": "Что может взять пешка на c6?"
  },
  {
    "id": "пешка_capture_b4",
    "fen": "2b5/2n5/8/n7/1P6/8/8/8 w - - 0 1",
    "moves": "b4a5",
    "title": "Что может взять пешка на b4?"
  },
  {
    "id": "пешка_capture_b3",
    "fen": "8/8/8/7p/2q5/1P6/8/1n6 w - - 0 1",
    "moves": "b3c4",
    "title": "Что может взять пешка на b3?"
  },
  {
    "id": "пешка_capture_c7",
    "fen": "1n6/2P5/8/b7/8/8/8/1b6 w - - 0 1",
    "moves": "c7b8",
    "title": "Что может взять пешка на c7?"
  },
  {
    "id": "пешка_capture_f6",
    "fen": "8/6n1/2n2P2/8/8/8/2b5/8 w - - 0 1",
    "moves": "f6g7",
    "title": "Что может взять пешка на f6?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "2r5/8/1p6/2P5/8/7p/8/8 w - - 0 1",
    "moves": "c5b6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "8/1p6/8/2r5/6p1/5P2/8/8 w - - 0 1",
    "moves": "f3g4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/6n1/8/3b4/4P3/4q3/8/8 w - - 0 1",
    "moves": "e4d5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/2b5/3P4/8/8/7p/8/q7 w - - 0 1",
    "moves": "d6c7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "1n6/8/8/5bp1/4P3/8/8/8 w - - 0 1",
    "moves": "e4f5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_b4",
    "fen": "8/8/8/2r5/1P6/8/4q3/7b w - - 0 1",
    "moves": "b4c5",
    "title": "Что может взять пешка на b4?"
  },
  {
    "id": "пешка_capture_b6",
    "fen": "8/b7/1Pr5/8/8/8/4p3/8 w - - 0 1",
    "moves": "b6a7",
    "title": "Что может взять пешка на b6?"
  },
  {
    "id": "пешка_capture_e4",
    "fen": "8/8/2p5/3n4/4P3/5n2/8/8 w - - 0 1",
    "moves": "e4d5",
    "title": "Что может взять пешка на e4?"
  },
  {
    "id": "пешка_capture_h3",
    "fen": "8/8/5q2/2r5/6b1/7P/8/8 w - - 0 1",
    "moves": "h3g4",
    "title": "Что может взять пешка на h3?"
  },
  {
    "id": "пешка_capture_d6",
    "fen": "8/2n5/3P4/8/8/8/1q6/6n1 w - - 0 1",
    "moves": "d6c7",
    "title": "Что может взять пешка на d6?"
  },
  {
    "id": "пешка_capture_g6",
    "fen": "4q3/7q/6P1/8/8/8/3q4/8 w - - 0 1",
    "moves": "g6h7",
    "title": "Что может взять пешка на g6?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1n6/P7/8/2p5/8/8/5n2/8 w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_c6",
    "fen": "8/1r6/2P5/8/8/3q4/5r2/8 w - - 0 1",
    "moves": "c6b7",
    "title": "Что может взять пешка на c6?"
  },
  {
    "id": "пешка_capture_f5",
    "fen": "n7/8/4q3/5P2/8/8/8/n7 w - - 0 1",
    "moves": "f5e6",
    "title": "Что может взять пешка на f5?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "6q1/8/2r5/8/3r4/2P5/8/8 w - - 0 1",
    "moves": "c3d4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_f3",
    "fen": "7b/b7/8/8/4q3/5P2/8/8 w - - 0 1",
    "moves": "f3e4",
    "title": "Что может взять пешка на f3?"
  },
  {
    "id": "пешка_capture_g6",
    "fen": "8/5q2/3p2P1/8/8/8/1n6/8 w - - 0 1",
    "moves": "g6f7",
    "title": "Что может взять пешка на g6?"
  },
  {
    "id": "пешка_capture_f5",
    "fen": "8/7n/6n1/5P2/3r4/8/8/8 w - - 0 1",
    "moves": "f5g6",
    "title": "Что может взять пешка на f5?"
  },
  {
    "id": "пешка_capture_h6",
    "fen": "8/6n1/2n4P/8/8/8/2p5/8 w - - 0 1",
    "moves": "h6g7",
    "title": "Что может взять пешка на h6?"
  },
  {
    "id": "пешка_capture_a5",
    "fen": "8/8/1p6/P3b3/8/r7/8/8 w - - 0 1",
    "moves": "a5b6",
    "title": "Что может взять пешка на a5?"
  },
  {
    "id": "пешка_capture_c6",
    "fen": "q7/3b4/2P5/8/2r5/8/8/8 w - - 0 1",
    "moves": "c6d7",
    "title": "Что может взять пешка на c6?"
  },
  {
    "id": "пешка_capture_g7",
    "fen": "5n2/6P1/8/8/8/2n4b/8/8 w - - 0 1",
    "moves": "g7f8",
    "title": "Что может взять пешка на g7?"
  },
  {
    "id": "пешка_capture_a7",
    "fen": "1q6/P7/5b2/8/8/4r3/8/8 w - - 0 1",
    "moves": "a7b8",
    "title": "Что может взять пешка на a7?"
  },
  {
    "id": "пешка_capture_h5",
    "fen": "8/8/6b1/1b5P/8/8/8/6b1 w - - 0 1",
    "moves": "h5g6",
    "title": "Что может взять пешка на h5?"
  },
  {
    "id": "пешка_capture_d5",
    "fen": "8/6q1/2q5/3P4/8/b7/8/8 w - - 0 1",
    "moves": "d5c6",
    "title": "Что может взять пешка на d5?"
  },
  {
    "id": "пешка_capture_f7",
    "fen": "4n3/5P2/8/8/4n3/8/8/7r w - - 0 1",
    "moves": "f7e8",
    "title": "Что может взять пешка на f7?"
  },
  {
    "id": "пешка_capture_f4",
    "fen": "8/5q2/8/6p1/5P2/q7/8/8 w - - 0 1",
    "moves": "f4g5",
    "title": "Что может взять пешка на f4?"
  },
  {
    "id": "пешка_capture_a3",
    "fen": "8/8/4r3/8/1r6/P7/7p/8 w - - 0 1",
    "moves": "a3b4",
    "title": "Что может взять пешка на a3?"
  },
  {
    "id": "пешка_capture_g2",
    "fen": "8/8/3b4/p7/8/7q/6P1/8 w - - 0 1",
    "moves": "g2h3",
    "title": "Что может взять пешка на g2?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/4p3/8/8/8/r7/1P6/6r1 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_e5",
    "fen": "8/7r/5q2/4P3/8/8/r7/8 w - - 0 1",
    "moves": "e5f6",
    "title": "Что может взять пешка на e5?"
  },
  {
    "id": "пешка_capture_b2",
    "fen": "8/8/6b1/8/8/r7/1P4b1/8 w - - 0 1",
    "moves": "b2a3",
    "title": "Что может взять пешка на b2?"
  },
  {
    "id": "пешка_capture_d4",
    "fen": "8/8/8/1nb5/3P4/8/8/4b3 w - - 0 1",
    "moves": "d4c5",
    "title": "Что может взять пешка на d4?"
  },
  {
    "id": "пешка_capture_c3",
    "fen": "8/8/8/8/1p6/2P5/b6p/8 w - - 0 1",
    "moves": "c3b4",
    "title": "Что может взять пешка на c3?"
  },
  {
    "id": "пешка_capture_d4",
    "fen": "3r4/8/8/2p2p2/3P4/8/8/8 w - - 0 1",
    "moves": "d4c5",
    "title": "Что может взять пешка на d4?"
  },
  {
    "id": "пешка_capture_b7",
    "fen": "b7/1P6/5n2/8/8/6q1/8/8 w - - 0 1",
    "moves": "b7a8",
    "title": "Что может взять пешка на b7?"
  },
  {
    "id": "пешка_capture_d5",
    "fen": "8/8/4p3/3P4/n7/8/2p5/8 w - - 0 1",
    "moves": "d5e6",
    "title": "Что может взять пешка на d5?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/8/1p6/4r3/3P4/7r/8 w - - 0 1",
    "moves": "d3e4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_a2",
    "fen": "8/8/7r/8/8/1p6/Pb6/8 w - - 0 1",
    "moves": "a2b3",
    "title": "Что может взять пешка на a2?"
  },
  {
    "id": "пешка_capture_g3",
    "fen": "8/6r1/8/8/7p/6P1/8/n7 w - - 0 1",
    "moves": "g3h4",
    "title": "Что может взять пешка на g3?"
  },
  {
    "id": "пешка_capture_c2",
    "fen": "2r5/6q1/8/8/8/1r6/2P5/8 w - - 0 1",
    "moves": "c2b3",
    "title": "Что может взять пешка на c2?"
  },
  {
    "id": "пешка_capture_f6",
    "fen": "8/6b1/5P2/1r6/8/8/8/5n2 w - - 0 1",
    "moves": "f6g7",
    "title": "Что может взять пешка на f6?"
  },
  {
    "id": "пешка_capture_f6",
    "fen": "3q4/6q1/5P2/8/8/8/8/7b w - - 0 1",
    "moves": "f6g7",
    "title": "Что может взять пешка на f6?"
  },
  {
    "id": "пешка_capture_c5",
    "fen": "8/8/3q4/2P5/8/8/4r3/7n w - - 0 1",
    "moves": "c5d6",
    "title": "Что может взять пешка на c5?"
  },
  {
    "id": "пешка_capture_g4",
    "fen": "4n3/8/8/2n2b2/6P1/8/8/8 w - - 0 1",
    "moves": "g4f5",
    "title": "Что может взять пешка на g4?"
  },
  {
    "id": "пешка_capture_c6",
    "fen": "8/3p4/2P5/8/5q2/8/8/6r1 w - - 0 1",
    "moves": "c6d7",
    "title": "Что может взять пешка на c6?"
  },
  {
    "id": "пешка_capture_d3",
    "fen": "8/8/6r1/8/2p5/3P4/2p5/8 w - - 0 1",
    "moves": "d3c4",
    "title": "Что может взять пешка на d3?"
  },
  {
    "id": "пешка_capture_f2",
    "fen": "8/8/8/8/2q5/6p1/5P2/n7 w - - 0 1",
    "moves": "f2g3",
    "title": "Что может взять пешка на f2?"
  },
  {
    "id": "пешка_capture_b7",
    "fen": "2n5/1P6/8/8/8/7r/1n6/8 w - - 0 1",
    "moves": "b7c8",
    "title": "Что может взять пешка на b7?"
  },
  {
    "id": "пешка_capture_b4",
    "fen": "8/8/8/2q5/1P6/8/1p6/n7 w - - 0 1",
    "moves": "b4c5",
    "title": "Что может взять пешка на b4?"
  },
  {
    "id": "пешка_capture_e7",
    "fen": "3r4/4P3/2q5/8/1r6/8/8/8 w - - 0 1",
    "moves": "e7d8",
    "title": "Что может взять пешка на e7?"
  }
];